<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [622]:
import pandas as pd
import psycopg2

In [623]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [624]:
connection = psycopg2.connect(
    dbname = 'project_sql',
    user = 'skillfactory',
    password= 'cCkxxLVrDE8EbvjueeMedPKt',
    host = '84.201.134.129',
    port = 5432
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [625]:
# текст запроса
query_3_1 = f'''select count(*)
           from vacancies
        '''

In [626]:
pd.read_sql_query(query_3_1, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\1467523473.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [627]:
query_3_2 = f'''select count(*)
           from employers
        '''

In [628]:
pd.read_sql_query(query_3_2, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\1321910889.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [629]:
query_3_3 = f'''select count(*)
           from areas
        '''

In [630]:
pd.read_sql_query(query_3_3, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\169222152.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [631]:
query_3_3 = f'''select count(*)
           from industries
        '''

In [632]:
pd.read_sql_query(query_3_3, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\169222152.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_3, connection)

   count
0    294

Наша база содержит около 50тыс вакансий. На каждого работодателя приходится примерно по 2 вакансии. Довольно обширная география вакансий.

***

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [633]:
query_4_1 = f'''select a.name as area, count(area_id) as cnt
                    from vacancies v join areas a
                        on v.area_id = a.id
                    group by 1
                    order by 2 desc
        '''

In [634]:
pd.read_sql_query(query_4_1, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\1702194938.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_1, connection)

                area   cnt
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [635]:
query_4_2 = f'''select  count(id)
    from vacancies 
where SALARY_FROM  is not null 
    or SALARY_TO is not null'''

In [636]:
pd.read_sql_query(query_4_2, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\495373726.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [637]:
query_4_3 = f'''select avg(SALARY_FROM)::int, 
                    avg(SALARY_TO)::int
                    from vacancies '''

In [638]:
pd.read_sql_query(query_4_3, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\2240822411.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_3, connection)

     avg     avg
0  71065  110537

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [639]:
query_4_4 = f'''select schedule, employment, count(id)
                    from vacancies
                group by schedule, employment
                order by 3 desc '''

In [640]:
pd.read_sql_query(query_4_4, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\3130347181.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [641]:
query_4_5 = f'''select distinct experience, count(id) over(partition by experience), 
                 (count(id) over(partition by experience)::float/count(id) over())*100 as percent
                    from vacancies
                order by 2 '''

In [642]:
pd.read_sql_query(query_4_5, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\3496489661.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_5, connection)

           experience  count    percent
0         Более 6 лет   1337   2.717645
1           Нет опыта   7197  14.628941
2       От 3 до 6 лет  14511  29.495701
3  От 1 года до 3 лет  26152  53.157713

Большинство вакансий размещено в крупных городах-миллиониках. Средняя зарплатная вилка в диапазоне от 70 до 110 тыс руб. В половине вакансий зарплатная вилка в принципе не указана. Поиск кандидатов осуществляется преимущетсвенно на полный рабочий день, достаточно большое кол-во вакансий предполагает удаленную работу. Кандидатов в большинстве своем ищут с относительно не большим опытом работы (от года), без опыта работы согласны рассмотреть в 14%

***

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [643]:
query_5_1 = '''select name, count
                from
                (select e.name as name, count(v.id) as count, 
                    rank() over(order by count(v.id) desc) as rank
                    from vacancies v join 
                        employers e 
                        on v.employer_id=e.id
                    group by 1
                    order by 2 desc) t1
                where  rank=1 or rank=5'''

In [644]:
pd.read_sql_query(query_5_1, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\2735860424.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [645]:
query_5_2 = '''select 
    t1.name, t1.count_empl, 
    count(v.id) as count_vac
from
    (select a.id id, a.name as name, 
    count(e.id) as count_empl
    from 
        areas a 
        left join
            employers e
        on e.area=a.id
    group by 1) t1
    
    left join vacancies v 
        on t1.id=v.area_id
    group by 1,2
    having count(v.id)=0
    order by 2 desc
    limit 1'''

In [646]:
pd.read_sql_query(query_5_2, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\1514608624.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_2, connection)

     name  count_empl  count_vac
0  Россия         410          0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [647]:
query_5_3 = '''select e.name, count(distinct v.area_id)
                    from employers e join vacancies  v
                on e.id=v.employer_id
                group by 1
                order by 2 desc'''

In [648]:
pd.read_sql_query(query_5_3, connection).head()

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\2853237418.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_3, connection).head()

                     name  count
0                  Яндекс    181
1              Ростелеком    152
2              Спецремонт    116
3  Поляков Денис Иванович     88
4               ООО ЕФИН      71

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [649]:
query_5_4 = '''select  count(e.id)
                    from employers e 
                        left join employers_industries ei
                        on e.id=ei.employer_id
                    where ei.industry_id is null'''

In [650]:
pd.read_sql_query(query_5_4, connection).head()

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\1206186997.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_4, connection).head()

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [651]:
query_5_5 = '''select e.name, count(ei.industry_id)
                    from employers e join employers_industries ei
                        on e.id=ei.employer_id
                    group by 1
                    having count(ei.industry_id)=4
                    order by 1
                    offset 2 limit 1'''

In [652]:
pd.read_sql_query(query_5_5, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\3334305160.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_5, connection)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [653]:
query_5_6 = f'''select  count(ei.employer_id)
from employers_industries ei join industries i
on ei.industry_id=i.id
where i.name='Разработка программного обеспечения'
'''

In [654]:
pd.read_sql_query(query_5_6, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\2432745783.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [655]:
import requests
import json
from bs4 import BeautifulSoup
url='https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
city=requests.get(url)
page = BeautifulSoup(city.text, 'html.parser') # Создаём объект BeautifulSoup, указывая html-парсер
table1=page.find('table',class_='standard')

In [656]:
headers = []
for i in table1.find_all('th'):
    title = i.text
    headers.append(title)
    
mydata = pd.DataFrame(columns = headers)
for j in table1.find_all('tr')[1:]:
    row_data = j.find_all('td')
    row = [i.text for i in row_data]
    length = len(mydata)
    mydata.loc[length] = row
    
city=tuple(list(mydata['Город'].replace('Воронеж[a]', 'Воронеж')))

In [657]:
query_5_7 = f'''select a.name, count(v.id)
from vacancies v join areas a
on v.area_id=a.id
join employers e on e.id=v.employer_id
where a.name in {city}
 and e.name='Яндекс'
group by 1

Union

select 'total', count(v.id)
from vacancies v join areas a
on v.area_id=a.id
join employers e on e.id=v.employer_id
where a.name in {city}
and e.name='Яндекс'
order by 2
'''

In [658]:
pd.read_sql_query(query_5_7, connection)

C:\Users\Vint\AppData\Local\Temp\ipykernel_2328\2888435755.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_7, connection)

               name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            total    485

Лидером среди компаний, рамещающих вакансии на сайте hh, является компания "Яндекс". Интересно отметить, что только 25% вакансий данной компании размещено в городах-миллионниках, география поиска сотрудников достаточно широкая. В число лидеров компаний осуществялющих активный поиск сотрудников, являются Банки, крупные промышленные компании и организации, предоставляющие телекоммуникационные услуги.

***

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [659]:
# текст запроса

In [660]:
# результат запроса

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [661]:
# текст запроса

In [662]:
# результат запроса

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [663]:
# текст запроса

In [664]:
# результат запроса

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [665]:
# текст запроса

In [666]:
# результат запроса

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [667]:
# текст запроса

In [668]:
# результат запроса

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [669]:
# текст запроса

In [670]:
# результат запроса

***

In [671]:
# выводы по предметному анализу

# Общий вывод по проекту

In [672]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования